---
kind: type
id: T:Autodesk.Revit.DB.GroupSet
source: html/cac73a6e-e521-7af1-281c-22c8e5245c03.htm
---
# Autodesk.Revit.DB.GroupSet

An set that contains groups.

## Syntax (C#)
```csharp
public class GroupSet : APIObject, IEnumerable
```